namespace CSGO_GC_Ext.Utils;

public static class EnumerableExtensions
{
    /// 运行时：.NET 9
    /// 原始类型：IEnumerable
    /// 测试数据量: 10000
    /// 测试索引: 5000
    /// 迭代次数: 10000
    /// ----------------------------------------
    /// Skip().First() : 00:00:00.0013030 ms
    ///     ElementAt(): 00:00:00.0004955 ms
    ///     ToArray()[]: 00:00:00.0008950 ms(包含转换时间)
    ///     ToArray()[]: 00:00:00.0000176 ms(不包含转换时间)
    ///      ToList()[]: 00:00:00.0007270 ms(包含转换时间)
    ///      ToList()[]: 00:00:00.0000357 ms(不包含转换时间)
    ///
    /// --- 测试多次随机访问性能 ---
    /// Skip().First() 多次随机访问: 00:00:00.0000894 ms
    /// ElementAt()    多次随机访问: 00:00:00.0000232 ms
    /// ToList()[]     多次随机访问: 00:00:00.0001389 ms

    
}
